MikroElektronika/core_packages/ARM/gcc_clang/def/arterytek/AT32F437RDT7/mcu.h
/**
  **************************************************************************
  * @file     at32f435_437.h
  * @brief    at32f435_437 header file
  **************************************************************************
  *
  * Copyright (c) 2025, Artery Technology, All rights reserved.
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

#ifndef __AT32F435_437_H
#define __AT32F435_437_H

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__CC_ARM)
 #pragma anon_unions
#endif


/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup AT32F435_437
  * @{
  */

/** @addtogroup Library_configuration_section
  * @{
  */

/**
  * tip: to avoid modifying this file each time you need to switch between these
  *      devices, you can define the device in your toolchain compiler preprocessor.
  */

#if !defined (AT32F435CCU7) && !defined (AT32F435CGU7) && !defined (AT32F435CMU7) && \
    !defined (AT32F435CCT7) && !defined (AT32F435CGT7) && !defined (AT32F435CMT7) && \
    !defined (AT32F435RCT7) && !defined (AT32F435RGT7) && !defined (AT32F435RMT7) && \
    !defined (AT32F435VCT7) && !defined (AT32F435VGT7) && !defined (AT32F435VMT7) && \
    !defined (AT32F435ZCT7) && !defined (AT32F435ZGT7) && !defined (AT32F435ZMT7) && \
    !defined (AT32F437RCT7) && !defined (AT32F437RGT7) && !defined (AT32F437RMT7) && \
    !defined (AT32F437VCT7) && !defined (AT32F437VGT7) && !defined (AT32F437VMT7) && \
    !defined (AT32F437ZCT7) && !defined (AT32F437ZGT7) && !defined (AT32F437ZMT7) && \
    !defined (AT32F435CDU7) && !defined (AT32F435CDT7) && !defined (AT32F435RDT7) && \
    !defined (AT32F435VDT7) && !defined (AT32F435ZDT7) && !defined (AT32F437RDT7) && \
    !defined (AT32F437VDT7) && !defined (AT32F437ZDT7) && !defined (AT32F435RGT7_7) && \
    !defined (AT32F435RMT7_7)

    #error "Please select first the target device used in your application (in at32f435_437.h file)"
#endif

#if defined (AT32F435CCU7) || defined (AT32F435CGU7) || defined (AT32F435CMU7)   || \
    defined (AT32F435CCT7) || defined (AT32F435CGT7) || defined (AT32F435CMT7)   || \
    defined (AT32F435RCT7) || defined (AT32F435RGT7) || defined (AT32F435RMT7)   || \
    defined (AT32F435VCT7) || defined (AT32F435VGT7) || defined (AT32F435VMT7)   || \
    defined (AT32F435ZCT7) || defined (AT32F435ZGT7) || defined (AT32F435ZMT7)   || \
    defined (AT32F435CDU7) || defined (AT32F435CDT7) || defined (AT32F435RDT7)   || \
    defined (AT32F435VDT7) || defined (AT32F435ZDT7) || defined (AT32F435RGT7_7) || \
    defined (AT32F435RMT7_7)

    #define AT32F435xx
#endif

#if defined (AT32F437RCT7) || defined (AT32F437RGT7) || defined (AT32F437RMT7) || \
    defined (AT32F437VCT7) || defined (AT32F437VGT7) || defined (AT32F437VMT7) || \
    defined (AT32F437ZCT7) || defined (AT32F437ZGT7) || defined (AT32F437ZMT7) || \
    defined (AT32F437RDT7) || defined (AT32F437VDT7) || defined (AT32F437ZDT7)

    #define AT32F437xx
#endif

/**
  * define with package
  */
#if defined (AT32F435ZCT7) || defined (AT32F435ZGT7) || defined (AT32F435ZMT7) || \
    defined (AT32F435ZDT7)

    #define AT32F435Zx
#endif

#if defined (AT32F435VCT7) || defined (AT32F435VGT7) || defined (AT32F435VMT7) || \
    defined (AT32F435VDT7)

    #define AT32F435Vx
#endif

#if defined (AT32F435RCT7) || defined (AT32F435RGT7)   || defined (AT32F435RMT7)   || \
    defined (AT32F435RDT7) || defined (AT32F435RGT7_7) || defined (AT32F435RMT7_7)

    #define AT32F435Rx
#endif

#if defined (AT32F435CCU7) || defined (AT32F435CGU7) || defined (AT32F435CMU7) || \
    defined (AT32F435CCT7) || defined (AT32F435CGT7) || defined (AT32F435CMT7) || \
    defined (AT32F435CDU7) || defined (AT32F435CDT7)

    #define AT32F435Cx
#endif

#if defined (AT32F437ZCT7) || defined (AT32F437ZGT7) || defined (AT32F437ZMT7) || \
    defined (AT32F437ZDT7)

    #define AT32F437Zx
#endif

#if defined (AT32F437VCT7) || defined (AT32F437VGT7) || defined (AT32F437VMT7) || \
    defined (AT32F437VDT7)

    #define AT32F437Vx
#endif

#if defined (AT32F437RCT7) || defined (AT32F437RGT7) || defined (AT32F437RMT7) || \
    defined (AT32F437RDT7)

    #define AT32F437Rx
#endif

/**
  * define with memory density
  */
#if defined (AT32F435CCU7) || defined (AT32F435CCT7) || defined (AT32F435RCT7) || \
    defined (AT32F435VCT7) || defined (AT32F435ZCT7)

    #define AT32F435xC
#endif

#if defined (AT32F435CDU7) || defined (AT32F435CDT7) || defined (AT32F435RDT7) || \
    defined (AT32F435VDT7) || defined (AT32F435ZDT7)

    #define AT32F435xD
#endif

#if defined (AT32F435CGU7) || defined (AT32F435CGT7) || defined (AT32F435RGT7)   || \
    defined (AT32F435VGT7) || defined (AT32F435ZGT7) || defined (AT32F435RGT7_7)

    #define AT32F435xG
#endif

#if defined (AT32F435CMU7) || defined (AT32F435CMT7) || defined (AT32F435RMT7)   || \
    defined (AT32F435VMT7) || defined (AT32F435ZMT7) || defined (AT32F435RMT7_7)

    #define AT32F435xM
#endif

#if defined (AT32F437RCT7) || defined (AT32F437VCT7) || defined (AT32F437ZCT7)

    #define AT32F437xC
#endif

#if defined (AT32F437RDT7) || defined (AT32F437VDT7) || defined (AT32F437ZDT7)

    #define AT32F437xD
#endif

